[
  {
    "imagesrc": "/src/assets/StartupImages/GlazeGPT.png",
    "altText": "GlazeGPT",
    "Name": "GlazeGPT",
    "Description": "GlazeGPT is a 2023 AI startup specializing in conversational AI solutions for businesses. It focuses on automating customer interactions through advanced natural language understanding. The platform aims to enhance customer engagement with personalized responses, making interactions more intuitive and efficient. By leveraging AI technology, GlazeGPT helps companies reduce operational costs and improve customer service quality.",
    "WebsiteLink": "https://www.glazegpt.com",
    "Date": "02/2023",
    "CurrentlyHiring": "Not Hiring Currently",
    "HiringLink": "https://www.linkedin.com/company/glazegpt/jobs/",
    "Founder": "Arjun Kapoor",
    "ParentCompany": "GlazeGPT",
    "IndustrySector": "AI/Tech"
  },
  {
    "imagesrc": "/src/assets/StartupImages/loopin.webp",
    "altText": "Loopin",
    "Name": "Loopin",
    "Description": "Loopin, established in 2023, is a productivity tool designed to streamline team workflows. It integrates seamlessly with calendars and email platforms, enabling users to organize meetings and set agendas more effectively. By tracking meeting outcomes, Loopin aims to boost workplace productivity and collaboration. Its user-friendly interface helps teams stay organized and efficient in managing their tasks.",
    "WebsiteLink": "https://www.letsloopin.com/",
    "Date": "04/2023",
    "CurrentlyHiring": "Product Owner",
    "HiringLink": "https://www.letsloopin.com/jobposting",
    "Founder": "Megha Suresh",
    "ParentCompany": "Loopin",
    "IndustrySector": "Productivity"
  },
  {
    "imagesrc": "/src/assets/StartupImages/RecurClub.jpg",
    "altText": "Recur Club",
    "Name": "Recur Club",
    "Description": "Recur Club is a 2023 FinTech startup offering non-dilutive capital solutions to businesses based on their recurring revenue streams. The platform simplifies capital raising by leveraging subscription-based cash flows, providing businesses with quick access to funds without equity dilution. Recur Club aims to support companies in managing and scaling their operations effectively through innovative financing options.",
    "WebsiteLink": "https://www.recurclub.com",
    "Date": "01/2023",
    "CurrentlyHiring": "Not Hiring Currently",
    "HiringLink": "https://www.linkedin.com/company/recurclub/jobs/",
    "Founder": "Eklavya Gupta",
    "ParentCompany": "Recur Club",
    "IndustrySector": "FinTech"
  },
  {
    "imagesrc": "/src/assets/StartupImages/Vauld.jpg",
    "altText": "Vauld",
    "Name": "Vauld",
    "Description": "Launched in 2023, Vauld is a cryptocurrency platform providing a suite of services including trading, lending, and borrowing digital assets. Users can earn interest on their cryptocurrencies and engage in various financial activities through the platform. Vauld’s comprehensive services aim to cater to both novice and experienced cryptocurrency users, making digital asset management more accessible.",
    "WebsiteLink": "https://www.vauld.com",
    "Date": "03/2023",
    "CurrentlyHiring": "Not Hiring Currently",
    "HiringLink": "https://www.linkedin.com/company/vauld/jobs/",
    "Founder": "Darshan Bathija",
    "ParentCompany": "Vauld",
    "IndustrySector": "FinTech/Crypto"
  },
  {
    "imagesrc": "/src/assets/StartupImages/Stackbox.jpeg",
    "altText": "StackBox",
    "Name": "StackBox",
    "Description": "StackBox, founded in 2023, focuses on AI-driven logistics and supply chain management solutions. The platform offers real-time visibility, predictive analytics, and route optimization to enhance operational efficiency. StackBox’s technology aims to improve logistics management for businesses by providing actionable insights and optimizing supply chain processes. Its solutions are designed to streamline logistics operations and reduce costs.",
    "WebsiteLink": "https://www.stackbox.xyz/",
    "Date": "05/2023",
    "CurrentlyHiring": "Logistics Analyst",
    "HiringLink": "https://www.linkedin.com/company/stackboxtech/jobs/",
    "Founder": "Shanmukha Boora",
    "ParentCompany": "StackBox",
    "IndustrySector": "LogisticsTech"
  },
  {
    "imagesrc": "/src/assets/StartupImages/Fashinza.jpg",
    "altText": "Fashinza",
    "Name": "Fashinza",
    "Description": "Fashinza, launched in 2022, is a B2B platform connecting fashion brands with suppliers for streamlined manufacturing. It offers real-time tracking and enhanced supply chain transparency, allowing brands to manage production efficiently. Fashinza aims to reduce lead times and improve production processes through its innovative platform. Its services help brands maintain high-quality standards while scaling their operations.",
    "WebsiteLink": "https://www.fashinza.com",
    "Date": "01/2022",
    "CurrentlyHiring": "Marketing Research Intern",
    "HiringLink": "https://fashinza.com/career/",
    "Founder": "Pawan Gupta, Abhishek Sharma",
    "ParentCompany": "Fashinza",
    "IndustrySector": "FashionTech"
  },
  {
    "imagesrc": "/src/assets/StartupImages/jar.png",
    "altText": "Jar",
    "Name": "Jar",
    "Description": "Jar is a fintech startup focused on automating savings by rounding up digital payments and investing the spare change in gold. Founded to encourage small savings, Jar offers an easy-to-use app that helps users accumulate wealth through incremental investments. Its innovative approach aims to make saving accessible and engaging for India’s middle class, fostering a culture of regular savings.",
    "WebsiteLink": "https://www.myjar.app/",
    "Date": "07/2022",
    "CurrentlyHiring": "Devops Engineer",
    "HiringLink": "https://app.pyjamahr.com/careers?company=Jar&company_uuid=68F3DCF4BA",
    "Founder": "Nishchay AG, Misbah Ashraf",
    "ParentCompany": "Jar",
    "IndustrySector": "FinTech"
  },
  {
    "imagesrc": "/src/assets/StartupImages/Bikayi.png",
    "altText": "Bikayi",
    "Name": "Bikayi",
    "Description": "Bikayi, established in 2022, assists small businesses in creating and managing their online stores. The platform provides comprehensive services including inventory management, online payment processing, and business analytics. Bikayi empowers local businesses to expand their online presence with ease, offering tools to help them scale their operations efficiently. Its solutions are tailored to meet the needs of small and medium-sized enterprises.",
    "WebsiteLink": "https://www.bikayi.com",
    "Date": "02/2022",
    "CurrentlyHiring": "Business Development Executive",
    "HiringLink": "https://www.bikayi.com/careers",
    "Founder": "Sonakshi Nathani",
    "ParentCompany": "Bikayi",
    "IndustrySector": "E-commerce"
  },
  {
    "imagesrc": "/src/assets/StartupImages/truefoundry.jpeg",
    "altText": "TrueFoundry",
    "Name": "TrueFoundry",
    "Description": "TrueFoundry, a 2022 startup, specializes in AI and DevOps solutions for machine learning developers. The platform automates the deployment, monitoring, and management of ML models in production environments. By streamlining these processes, TrueFoundry helps developers focus on building models rather than managing infrastructure. Its solutions are designed to enhance the efficiency and scalability of machine learning projects.",
    "WebsiteLink": "https://www.truefoundry.com",
    "Date": "03/2022",
    "CurrentlyHiring": "Software Engineer",
    "HiringLink": "https://www.linkedin.com/jobs/view/software-engineer-backend-intern-at-truefoundry-3779508170/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic&originalSubdomain=in",
    "Founder": "Abhishek Choudhary",
    "ParentCompany": "TrueFoundry",
    "IndustrySector": "AI/DevOps"
  },
  {
    "imagesrc": "/src/assets/StartupImages/Heaps.png",
    "altText": "Heaps",
    "Name": "Heaps",
    "Description": "Heaps, founded in 2022, is a healthtech platform dedicated to preventive healthcare. It uses AI to monitor health metrics and provides personalized recommendations to improve well-being. By leveraging data-driven insights, Heaps helps users manage their health proactively. The platform aims to offer actionable advice and enhance users' overall health through its innovative solutions.",
    "WebsiteLink": "https://www.heaps.ai/index_in.html",
    "Date": "09/2022",
    "CurrentlyHiring": "Data Analyst",
    "HiringLink": "https://www.heaps.ai/careers.html",
    "Founder": "Dr. Anjali Sharma",
    "ParentCompany": "Heaps",
    "IndustrySector": "HealthTech"
  },
  {
    "imagesrc": "/src/assets/StartupImages/plum.jpeg",
    "altText": "Plum",
    "Name": "Plum",
    "Description": "Plum, founded in 2021, offers a comprehensive HR and employee benefits platform. It provides services like employee wellness programs, insurance, and financial planning tools. Plum aims to simplify employee benefits management for businesses, enhancing the overall employee experience. By integrating various HR functions into a single platform, Plum supports companies in creating a more efficient and engaging workplace.",
    "WebsiteLink": "https://www.plumhq.com",
    "Date": "01/2021",
    "CurrentlyHiring": "HR Specialist",
    "HiringLink": "https://www.linkedin.com/company/plumhq/jobs/",
    "Founder": "Saurabh Arora",
    "ParentCompany": "Plum",
    "IndustrySector": "HRTech"
  },
  {
    "imagesrc": "/src/assets/StartupImages/zepto.png",
    "altText": "Zepto",
    "Name": "Zepto",
    "Description": "Zepto is a quick-commerce startup launched in 2021, offering 10-minute grocery delivery services across major cities in India. Its efficient delivery model is revolutionizing the grocery retail market in the country.",
    "WebsiteLink": "https://www.zeptonow.com/",
    "Date": "11/2021",
    "CurrentlyHiring": "Category Manager",
    "HiringLink": "https://zeptonow.openings.co/#!/#openpositions",
    "Founder": "Aadit Palicha, Kaivalya Vohra",
    "ParentCompany": "Zepto",
    "IndustrySector": "Quick Commerce"
  },
  {
    "imagesrc": "/src/assets/StartupImages/Mobikwik.jpg",
    "altText": "Mobikwik",
    "Name": "Mobikwik",
    "Description": "Mobikwik is a digital wallet and mobile phone-based payment system founded in 2009. It allows users to store money in a virtual wallet and make purchases across different platforms such as e-commerce websites, utility payments, and more. Mobikwik has grown to become one of India's leading digital wallet companies, offering various services like bill payments, financial services, and loans. They also introduced their 'Buy Now Pay Later' product, increasing their foothold in the fintech space. The company has received significant funding and has been in competition with other digital payment services like Paytm and PhonePe.",
    "WebsiteLink": "https://www.mobikwik.com",
    "Date": "04/2009",
    "CurrentlyHiring": "Software Engineer",
    "HiringLink": "https://www.mobikwik.com/careers",
    "Founder": "Bipin Preet Singh, Upasana Taku",
    "ParentCompany": "Mobikwik",
    "IndustrySector": "FinTech"
  },
  {
    "imagesrc": "/src/assets/StartupImages/Bewakoof.jpg",
    "altText": "Bewakoof",
    "Name": "Bewakoof",
    "Description": "Bewakoof is an online fashion and lifestyle brand founded in 2012. The company started with quirky and fun t-shirt designs and has now expanded into a wide range of apparel and accessories for both men and women. Bewakoof has successfully tapped into the youth market with its unique and relatable designs, using social media platforms to connect with millennials and Gen Z. With a focus on affordability, the brand quickly gained traction and has millions of customers across India. Bewakoof continues to grow, offering a variety of products from trendy outfits to lifestyle accessories.",
    "WebsiteLink": "https://www.bewakoof.com",
    "Date": "04/2012",
    "CurrentlyHiring": "Frontend Developer",
    "HiringLink": "https://bewakoof.com/careers",
    "Founder": "Prabhkiran Singh",
    "ParentCompany": "Bewakoof",
    "IndustrySector": "FashionTech"
  },
  {
    "imagesrc": "/src/assets/StartupImages/Healthifyme.png",
    "altText": "HealthifyMe",
    "Name": "HealthifyMe",
    "Description": "HealthifyMe is a health and fitness application launched in 2012, focusing on offering personalized diet and workout plans to its users. The app integrates the power of AI along with human nutritionists and fitness coaches to guide people in achieving their health goals. HealthifyMe tracks users' calorie intake, activity levels, and overall health parameters, providing insights and feedback on improving their health. The company has expanded its services globally, and its AI assistant, Ria, helps users with basic health queries. HealthifyMe is one of India's leading digital health platforms and continues to grow rapidly with its innovative solutions.",
    "WebsiteLink": "https://www.healthifyme.com",
    "Date": "04/2012",
    "CurrentlyHiring": "Consultant",
    "HiringLink": "https://healthify.darwinbox.in/ms/candidate/careers",
    "Founder": "Tushar Vashisht, Sachin Shenoy, Mathew Cherian",
    "ParentCompany": "HealthifyMe",
    "IndustrySector": "HealthTech"
  },
  {
    "imagesrc": "/src/assets/StartupImages/NoBroker.png",
    "altText": "NoBroker",
    "Name": "NoBroker",
    "Description": "NoBroker is a property search platform founded in 2014, which eliminates brokers and connects property owners with potential tenants or buyers directly. The platform is designed to offer a cost-effective and hassle-free experience for individuals looking to rent, buy, or sell properties without the involvement of real estate agents. NoBroker operates in several Indian cities and provides additional services such as legal assistance, home loans, and property management. The platform has received significant funding and has expanded its offerings to become one of the largest property platforms in India, revolutionizing the real estate market.",
    "WebsiteLink": "https://www.nobroker.com",
    "Date": "03/2014",
    "CurrentlyHiring": "Graphic Designer",
    "HiringLink": "https://www.linkedin.com/jobs/search/?currentJobId=4004767210&f_C=9226228",
    "Founder": "Amit Agarwal, Akhil Gupta, Saurabh Garg",
    "ParentCompany": "No Broker",
    "IndustrySector": "PropTech"
  },
  {
    "imagesrc": "/src/assets/StartupImages/Blinkit.png",
    "altText": "Blinkit",
    "Name": "Blinkit",
    "Description": "Blinkit, formerly known as Grofers, is an online grocery delivery service founded in 2013. The platform offers on-demand delivery of groceries and other household essentials in various cities across India. Blinkit operates on a quick-commerce model, promising deliveries within minutes, and has a vast network of warehouses and partners to facilitate its services. In 2021, the company rebranded to Blinkit, reflecting its focus on fast deliveries. The platform has seen rapid growth, especially during the pandemic, and continues to compete with other quick commerce and grocery delivery services in the Indian market.",
    "WebsiteLink": "https://www.blinkit.com",
    "Date": "12/2013",
    "CurrentlyHiring": "Growth Manager",
    "HiringLink": "https://www.linkedin.com/jobs/search/?currentJobId=4005827807&keywords=blinkit&originalSubdomain=in",
    "Founder": "Albinder Dhindsa, Saurabh Kumar",
    "ParentCompany": "Blinkit",
    "IndustrySector": "E-Commerce"
  },

  {
    "imagesrc": "/src/assets/StartupImages/Redyfynd.png",
    "altText": "Redyfynd",
    "Name": "Redyfynd",
    "Description": "Redyfynd is a location-based discovery platform that connects users to nearby events, deals, and stores. Launched to simplify finding places of interest, Redyfynd uses AI and user data to provide personalized recommendations. The platform has grown to cover a wide range of cities and is becoming a popular app for urban explorers and shoppers.",
    "WebsiteLink": "https://www.redfynd.com/",
    "Date": "06/2017",
    "CurrentlyHiring": "Not Hiring Currently",
    "HiringLink": "https://www.linkedin.com/company/artyvis/jobs/",
    "Founder": "Raghav Goyal",
    "ParentCompany": "Redyfynd",
    "IndustrySector": "AI"
  },

  {
    "imagesrc": "/src/assets/StartupImages/BharatPe.jpg",
    "altText": "BharatPe",
    "Name": "BharatPe",
    "Description": "BharatPe is a financial technology company founded in 2018, aimed at helping merchants in India accept digital payments and access loans. Its services include QR code-based payments and small business loans. BharatPe has gained rapid traction due to its zero MDR (Merchant Discount Rate) approach, and it is now expanding into other financial services.",
    "WebsiteLink": "https://www.bharatpe.com",
    "Date": "03/2018",
    "CurrentlyHiring": "SDE III",
    "HiringLink": "https://www.bharatpe.com/careers",
    "Founder": "Ashneer Grover, Shashvat Nakrani",
    "ParentCompany": "BharatPe",
    "IndustrySector": "FinTech"
  },
  {
    "imagesrc": "/src/assets/StartupImages/healthkart.jpeg",
    "altText": "Healthkart",
    "Name": "Healthkart",
    "Description": "Healthkart is a leading online marketplace for health and nutrition products in India. Established in 2011, Healthkart offers a wide range of supplements, vitamins, and fitness-related products. The platform also provides personalized health advice to its users. Over the years, Healthkart has grown to become the go-to platform for fitness enthusiasts.",
    "WebsiteLink": "https://www.healthkart.com",
    "Date": "02/2011",
    "CurrentlyHiring": "Product Manager",
    "HiringLink": "https://www.healthkart.com/careers",
    "Founder": "Sameer Maheshwari, Prashant Tandon",
    "ParentCompany": "Healthkart",
    "IndustrySector": "HealthTech"
  },
  {
    "imagesrc": "/src/assets/StartupImages/TheShirtDanady.jpeg",
    "altText": "The Shirt Dandy",
    "Name": "The Shirt Dandy",
    "Description": "The Shirt Dandy is a premium online clothing brand specializing in custom-made shirts for men. Founded in 2016, the company offers users the option to personalize their shirts with different fabrics, designs, and fits. The brand focuses on providing high-quality apparel for modern professionals, aiming to bring craftsmanship into everyday fashion.",
    "WebsiteLink": "https://www.theshirtdandy.com",
    "Date": "09/2016",
    "CurrentlyHiring": "Not Hiring Currently",
    "HiringLink": "https://www.linkedin.com/company/theshirtdandy/jobs/",
    "Founder": "Vishal Saxena",
    "ParentCompany": "The Shirt Dandy",
    "IndustrySector": "FashionTech"
  },
  {
    "imagesrc": "/src/assets/StartupImages/Khatabook.avif",
    "altText": "Khatabook",
    "Name": "Khatabook",
    "Description": "Khatabook is a digital ledger application that helps small businesses in India manage their finances. Launched in 2019, it replaces the traditional notebook system used by shop owners and helps them record transactions, track debts, and manage cash flow efficiently. Khatabook has seen significant growth and adoption among local merchants, making it a key player in India's digital economy.",
    "WebsiteLink": "https://www.khatabook.com",
    "Date": "01/2019",
    "CurrentlyHiring": "Business Analyst",
    "HiringLink": "https://khatabook.com/hiring/",
    "Founder": "Ravish Naresh",
    "ParentCompany": "Khatabook",
    "IndustrySector": "FinTech"
  },
  {
    "imagesrc": "/src/assets/StartupImages/Zerodha.png",
    "altText": "Zerodha",
    "Name": "Zerodha",
    "Description": "Zerodha is a discount brokerage firm established in 2010. It revolutionized the stock trading industry in India by offering minimal brokerage fees, making it accessible to retail investors. Zerodha's platform offers trading in stocks, derivatives, commodities, and mutual funds. With its user-friendly app and technology-driven approach, Zerodha has become one of the largest brokerage firms in India.",
    "WebsiteLink": "https://www.zerodha.com",
    "Date": "08/2010",
    "CurrentlyHiring": "Not Hiring Currently",
    "HiringLink": "https://careers.zerodha.com",
    "Founder": "Nithin Kamath",
    "ParentCompany": "Zerodha",
    "IndustrySector": "FinTech"
  },
  {
    "imagesrc": "/src/assets/StartupImages/Sugar.jpg",
    "altText": "Sugar",
    "Name": "Sugar",
    "Description": "Sugar Cosmetics is a beauty and personal care brand founded in 2015. The brand targets millennials and offers a range of high-quality, cruelty-free makeup products. With its bold and vibrant aesthetics, Sugar has quickly become one of the most popular beauty brands in India. It operates both online and through physical stores across the country.",
    "WebsiteLink": "https://www.sugarcosmetics.com",
    "Date": "09/2015",
    "CurrentlyHiring": "Social Media Manager",
    "HiringLink": "https://www.sugarcosmetics.com/careers",
    "Founder": "Vineeta Singh, Kaushik Mukherjee",
    "ParentCompany": "Sugar",
    "IndustrySector": "BeautyTech"
  },
  {
    "imagesrc": "/src/assets/StartupImages/OfBusiness.jpeg",
    "altText": "OfBusiness",
    "Name": "OfBusiness",
    "Description": "OfBusiness is a B2B commerce and financing platform, founded in 2015, catering to SMEs in the manufacturing and construction sectors. The platform provides procurement solutions along with financial services like loans and credit lines to help businesses grow. OfBusiness leverages technology to offer fast and affordable financing to its clients.",
    "WebsiteLink": "https://www.ofbusiness.com",
    "Date": "07/2015",
    "CurrentlyHiring": "Business Development",
    "HiringLink": "https://www.linkedin.com/company/ofbusiness/jobs/",
    "Founder": "Asish Mohapatra",
    "ParentCompany": "OfBusiness",
    "IndustrySector": "FinTech"
  },
  {
    "imagesrc": "/src/assets/StartupImages/BlueTokaiCoffee.png",
    "altText": "Blue Tokai Coffee Roasters",
    "Name": "Blue Tokai Coffee Roasters",
    "Description": "Blue Tokai Coffee Roasters is a specialty coffee brand that was founded in 2013. The company sources its beans from Indian farms and offers artisanal roasting and brewing. Blue Tokai has helped revive India’s coffee culture, offering its products through its cafes, retail outlets, and e-commerce platform.",
    "WebsiteLink": "https://www.bluetokaicoffee.com",
    "Date": "11/2013",
    "CurrentlyHiring": "Cafe Manager",
    "HiringLink": "https://www.bluetokaicoffee.com/careers",
    "Founder": "Matt Chitharanjan, Namrata Asthana",
    "ParentCompany": "Blue Tokai Coffee",
    "IndustrySector": "FoodTech"
  },

  {
    "imagesrc": "/src/assets/StartupImages/QApita.jpg",
    "altText": "QApita",
    "Name": "QApita",
    "Description": "QApita is a digital equity management platform for startups, investors, and law firms. Founded in 2020, it allows companies to manage cap tables, employee stock option plans (ESOPs), and fundraising documentation. QApita simplifies the process of equity management and helps startups stay organized and compliant.",
    "WebsiteLink": "https://www.qapita.com",
    "Date": "05/2020",
    "CurrentlyHiring": "Full Stack Developer",
    "HiringLink": "https://www.qapita.com/careers",
    "Founder": "Vamsee Tirukkala",
    "ParentCompany": "QApita",
    "IndustrySector": "FinTech"
  },

  {
    "imagesrc": "/src/assets/StartupImages/Zolve.png",
    "altText": "Zolve",
    "Name": "Zolve",
    "Description": "Zolve is a fintech startup that offers global bank accounts and credit cards for individuals moving to new countries. Launched in 2020, Zolve allows customers to open accounts and build credit histories in their new destination before they even move. Its services are aimed at simplifying banking for international students, professionals, and immigrants.",
    "WebsiteLink": "https://www.zolve.com",
    "Date": "08/2020",
    "CurrentlyHiring": "Business Analyst",
    "HiringLink": "https://zolve.freshteam.com/jobs",
    "Founder": "Raghunandan G",
    "ParentCompany": "Zolve",
    "IndustrySector": "FinTech"
  },
  {
    "imagesrc": "/src/assets/StartupImages/RevFin.png",
    "altText": "RevFin",
    "Name": "RevFin",
    "Description": "RevFin is a digital lending platform focused on electric vehicle (EV) financing. Founded in 2018, the platform provides loans to individuals and businesses for purchasing electric vehicles, with an emphasis on sustainability. RevFin has quickly become a key player in India's EV ecosystem, supporting the growth of clean transportation.",
    "WebsiteLink": "https://www.revfin.in/",
    "Date": "04/2018",
    "CurrentlyHiring": "Not Hiring Currently",
    "HiringLink": "https://revfin.in/career#cards",
    "Founder": "Sameer Aggarwal",
    "ParentCompany": "RevFin",
    "IndustrySector": "FinTech"
  }
]
